[
    {
        "title": "Floods hit South Africa’s KwaZulu-Natal province again",
        "excerpt": "The floods come only a month after torrential rains killed 435 people in KwaZulu-Natal.",
        "Positive Sentiment": 0.0,
        "Negative Sentiment": 0.273,
        "Neutral Sentiment": 0.727
    },
    {
        "title": "Mozambique: Cyclone Gombe death toll rises to 53",
        "excerpt": "In recent years, Southern Africa has suffered repeated devastating cyclones that used to be relatively rare.",
        "Positive Sentiment": 0.0,
        "Negative Sentiment": 0.349,
        "Neutral Sentiment": 0.651
    },
    {
        "title": "Mozambique announces new prime minister after cabinet reshuffle",
        "excerpt": "New ministers were named after a major reshuffle by President Filipe Nyusi.",
        "Positive Sentiment": 0.0,
        "Negative Sentiment": 0.0,
        "Neutral Sentiment": 1.0
    },
    {
        "title": "Analysis: Can African gas replace Russian supplies to Europe?",
        "excerpt": "A lack of infrastructure, not capacity, could hurt the continent’s plan to supply gas to Europe in Russia’s stead.",
        "Positive Sentiment": 0.132,
        "Negative Sentiment": 0.109,
        "Neutral Sentiment": 0.759
    },
    {
        "title": "Dozens dead from Tropical Storm Ana in southern Africa",
        "excerpt": "At least 70 killed in storm that struck Madagascar, Mozambique and Malawi as authorities scramble to repair damages.",
        "Positive Sentiment": 0.0,
        "Negative Sentiment": 0.385,
        "Neutral Sentiment": 0.615
    },
    {
        "title": "Southern Africa bloc SADC extends Mozambique mission",
        "excerpt": "Regional body says progress made against rebels in Cabo Delgado province since troops deployed last year.",
        "Positive Sentiment": 0.151,
        "Negative Sentiment": 0.097,
        "Neutral Sentiment": 0.753
    },
    {
        "title": " Start Here",
        "excerpt": "Why people in Madagascar are starving.",
        "Positive Sentiment": 0.0,
        "Negative Sentiment": 0.359,
        "Neutral Sentiment": 0.641
    },
    {
        "title": "In Mozambique, Kagame says Rwandan troops’ work not over",
        "excerpt": "Rwandan president says his country’s force will help secure and rebuild Cabo Delgado areas destroyed by armed campaign.",
        "Positive Sentiment": 0.219,
        "Negative Sentiment": 0.137,
        "Neutral Sentiment": 0.644
    },
    {
        "title": "Rwanda, Mozambique forces recapture port city from rebels",
        "excerpt": "Mocimboa da Praia, home to one of Africa’s biggest natural gas projects, retaken from rebels, Rwandan army says.",
        "Positive Sentiment": 0.123,
        "Negative Sentiment": 0.089,
        "Neutral Sentiment": 0.788
    },
    {
        "title": "Rwanda deploys 1,000 soldiers to Mozambique’s Cabo Delgado",
        "excerpt": "Gov’t says deployment at request of Mozambican authorities aimed at restoring state control in conflict-hit province.",
        "Positive Sentiment": 0.128,
        "Negative Sentiment": 0.0,
        "Neutral Sentiment": 0.872
    },
    {
        "title": "Southern African nations agree to deploy forces to Mozambique",
        "excerpt": "The SADC Standby Force will support Mozambique ‘to combat terrorism and acts of violent extremism’ in Cabo Delgado.",
        "Positive Sentiment": 0.098,
        "Negative Sentiment": 0.395,
        "Neutral Sentiment": 0.507
    },
    {
        "title": "Visualising 70 years of refugee journeys",
        "excerpt": "On World Refugee Day, Al Jazeera looks at the painful journeys refugees were forced on in 2020 despite global pandemic.",
        "Positive Sentiment": 0.0,
        "Negative Sentiment": 0.247,
        "Neutral Sentiment": 0.753
    },
    {
        "title": "Dozens of children, mostly girls, abducted by Mozambique fighters",
        "excerpt": "Save the Children says 51 minors taken by armed groups in Cabo Delgado in 2020, a figure likely an underestimate.",
        "Positive Sentiment": 0.143,
        "Negative Sentiment": 0.098,
        "Neutral Sentiment": 0.759
    },
    {
        "title": "White people rescued before Black people in Palma: Amnesty",
        "excerpt": "Rights group alleges white contractors airlifted to safety before local Black people after raid on Mozambican town.",
        "Positive Sentiment": 0.149,
        "Negative Sentiment": 0.0,
        "Neutral Sentiment": 0.851
    }
]